animals = [
["Барсик", "рысь", 18],
["Слоник", "слон", 5400],
["Луна", "волк", 32],
["Грибочек", "лиса", 18],
["Миша", "медведь", 310],
["Тигра", "тигр", 220],
["Король", "лев", 205],
["Снежок", "заяц", 4],
["Гром", "бизон", 720],
["Норка", "енот", 9],
["Марта", "жираф", 810],
["Шторм", "носорог", 2100],
["Дымка", "пума", 68],
["Мила", "лама", 130],
["Кузя", "кабан", 140],
["Зевс", "орел", 6],
["Плюша", "панда", 115],
["Искра", "антилопа", 95],
["Яша", "ягуар", 96],
["Няня", "обезьяна", 27],
["Тор", "лось", 430],
["Лада", "косуля", 34],
["Шура", "сурикат", 5],
["Гоша", "бегемот", 1600],
["Рада", "зебра", 280],
["Туман", "волк", 41],
["Кира", "рысь", 21],
["Мишка", "медведь", 360],
["Феня", "лиса", 14],
["Арчи", "тигр", 240],
["Веста", "леопард", 72],
["Птичка", "соболь", 8],
["Пороро", "пингвин", 12],
["Ева", "кенгуру", 85],
["Грант", "верблюд", 540],
["Оскар", "осел", 190],
["Шустрик", "лама", 145],
["Тюльпан", "альпака", 62],
["Милашка", "сурикат", 6],
["Умник", "шимпанзе", 48],
["Великан", "слон", 4900],
["Зубр", "зубр", 790],
["Апельсинка", "капибара", 51],
["Работа", "волк", 38],
["Высь", "рысь", 19],
["Персик", "орангутан", 77],
["Юта", "пума", 70],
["Пумба", "кабан", 155],
["Розовый", "фламинго", 3],
["Тедди", "медведь", 295],
["Мурка", "корова", 410],
["Трус", "страус", 104],
["Тайга", "тигр", 228],
["Жулик", "енот", 11],
["Тимон", "сурикат", 4],
["Симба", "лев", 198],
["Сима", "лиса", 16],
["Бруно", "ягуар", 101],
["Вихрь", "лошадь", 460],
["Ветер", "косуля", 29],
["Бегемотик", "бегемот", 1750],
["Полоска", "зебра", 300],
["Рере", "пингвин", 13],
["Мира", "кенгуру", 79],
["Серый", "волк", 44],
["Рыка", "рысь", 20],
["Рожок", "носорог", 2300],
["Кузко", "лама", 128],
["Ти", "тигр", 235],
["Бэлла", "леопард", 67],
["Сестрица", "лиса", 15],
["Панда", "панда", 109],
["Заря", "антилопа", 89],
["Тим", "обезьяна", 24],
["Высотка", "жираф", 780],
["Орфей", "орел", 5],
["Лаки", "соболь", 7],
["Скай", "ястреб", 4],
["Капибара", "капибара", 56],
["Аякс", "бизон", 680],
["Нелли", "альпака", 58],
["Вилли", "осел", 175],
["Дора", "пума", 73],
["Макс", "кабан", 148],
["Лея", "фламинго", 4],
["Ральф", "медведь", 340],
["Волк", "волк", 36],
["Умка", "белый медведь", 410],
["Кай", "снежный барс", 44],
["Пушистик", "рысь", 22],
["Денди", "страус", 97],
["Бусинка", "енот", 10],
["Грэм", "зубр", 810],
["Молния", "лошадь", 430],
["Фред", "кенгуру", 91],
["Есения", "зебра", 275],
["Нептун", "морской лев", 260],
["Сальма", "лама", 132],
["Грей", "леопард", 69],
["Ирис", "лиса", 17],
["Земля", "сурикат", 5],
["Юпитер", "слон", 5200],
["Роса", "косуля", 31],
["Арфа", "антилопа", 87],
["Шериф", "волк", 43],
["Пума", "пума", 71],
["Дина", "обезьяна", 26],
["Коди", "пингвин", 14],
["Лавр", "верблюд", 560],
["Папанда", "панда", 112],
["Мускат", "кабан", 162],
["Топаз", "ягуар", 98],
["Сонатa", "жираф", 840],
["Бакс", "лев", 212],
["Челси", "лиса", 13],
["Рубин", "тигр", 245],
["Линда", "енот", 12],
["Аметист", "пума", 66],
["Триша", "альпака", 60],
["Единорог", "носорог", 2250],
["Мята", "капибара", 54],
["Орел", "орел", 6],
["Гуфи", "обезьяна", 29],
["Север", "бизон", 705],
["Жасмин", "лама", 126],
["Каспер", "снежный барс", 47],
["Моника", "зебра", 290],
["Айс", "пингвин", 11],
["Терра", "рысь", 23],
["Флинт", "волк", 39],
["Белка", "сурикат", 4],
["Гера", "лиса", 18],
["Стелла", "кенгуру", 83],
["Морис", "медведь", 330],
["Киви", "фламинго", 3],
["Рой", "кабан", 150],
["Аврора", "леопард", 74],
["Платон", "осел", 185],
["Дунай", "лошадь", 470],
["Вега", "антилопа", 92],
["Наоми", "панда", 118],
["Подлодка", "морской лев", 245],
["Шая", "капибара", 53],
["Корсар", "зубр", 830],
["Ева", "лиса фенек", 6],
["Магнолия", "альпака", 63],
["Рокси", "рысь", 24],
["Тайфун", "лев", 208],
["Сафира", "тигр", 232],
["Оливер", "енот", 9],
["Луна", "фламинго", 4],
["Граф", "верблюд", 590],
["Нокс", "снежный барс", 46],
]

import pprint

def quick_sort(list_to_sort, left, right, key=lambda x: x):
    i, j = left, right
    pivot = list_to_sort[(left + right) // 2]
    while i <= j:
        while key(list_to_sort[i]) < key(pivot): i += 1
        while key(list_to_sort[j]) > key(pivot): j -= 1
        if i <= j:
            list_to_sort[i], list_to_sort[j] = list_to_sort[j], list_to_sort[i]
            i += 1
            j -= 1
    if left < j:
        quick_sort(list_to_sort, left, j, key)
    if i < right:
        quick_sort(list_to_sort, i, right, key)

quick_sort(animals, 0, len(animals) - 1, key=lambda x: (x[2], x[0]))


#1
print("========================================================================================")
for animal in animals:
    print(animal)

#2
print("========================================================================================")
print(f"Минимальный вес: {animals[:3]}")
print(f"Максимальный вес: {animals[-3:]}")

#3
print("========================================================================================")
def find_animals(mass, lst):
    for animal in lst:
        if animal[2] == mass:
            print(animal)

find_animals(3, animals)

#4
print("========================================================================================")
def group(lst):
    animals_dict = {}
    for animal in lst:
        if str(animal[2]) in animals_dict.keys():
            animals_dict[str(animal[2])].append([animal[0], animal[1]])
        else:
            animals_dict[str(animal[2])] = [[animal[0], animal[1]]]

    return animals_dict

print(group(animals))




# def name_sort(list_to_sort):
#     perv_index = 0
#     index = 0
#     while index < len(list_to_sort):
#         while list_to_sort[perv_index][2] == list_to_sort[index][2]: index += 1
#         list_to_sort[perv_index:index] = sorted(list_to_sort[perv_index:index], key=lambda x: x[0])
#         perv_index = index
#
#
# name_sort(animals)

